dynsite/dynsite-org/dynsite-help.org
#+TITLE: DynSite: Dynamic Org 2 HTML Project definition

This is a guide to using the dynamic org-to-html publishing project definition scheme called DynSite. 

DynSite is an extension of the default project publishing scheme of orgmode. Instead of writing project definitions in emacs-lisp as is done in the original orgmode publishing scheme, the present extension allows one to define and customize the projects by putting them in folders and to define their custom parameters in plain text, using orgmode markup.

* Quick setup

@<b>For a summary of all commands and quick configuration guide for setting up a site see [[./org-publish-command-reference.org][here]].@</b>

* Site File Structure

** Source and Target Folders

DynSite expects all org-to-html projects to be stored as subfolders of one single folder. For example, if one has 3 projects named project1, project2 and project3, one could place them in one folder named org as follows: 

|-----------------------------------+-------------------------------------|
| path                              | contents                            |
|-----------------------------------+-------------------------------------|
| /users/user1/websites/org         | top folder containing all projects  |
| /users/user1/website/org/project1 | all files (and folders) of project1 |
| /users/user1/website/org/project2 | all files (and folders) of project2 |
| /users/user1/website/org/project2 | all files (and folders) of project3 |
|-----------------------------------+-------------------------------------|

A folder containing one or more subfolders with different projects, where each project has its own properties regarding css styles, preamble and postamble and other publishing properties, is called a *site*. These projects are published in subfolders of a single target folder, preserving the same structure as the source folder. 

It is possible to work with several different sites, where each site has its own source folder (the org project files), its own target folder (the published html files) and a url for uploading the rendered html files to a server using rsync. See [[Working with multiple sites]] below. 

** Project Definition

There is only one rule for defining a project: 

*If* a folder is contained in the top folder containing all projects *and* this folder contains a file called /config.org/ *then* this folder becomes a project folder. 

This means: To define a new project for publishing, you must do 2 things: 

1. Create a folder for the project, which is contained inside the top folder holding all projects, or one of its subfolders
2. Create a file called config.org inside the top level of the folder that contains the project. 

The contents of the file config.org define the properties of the project, i.e. they customize the project. In orgmode, the publishing options of a project are defined as (emacs-lisp) properties. These are described in section "13.1.5 Options for the HTML/LaTeX exporters" of the org-info documentation (type "meta-x org-info" to enter the org-info documentation, then go to section (menu item) Publishing, subsection Configuration, subsubsection "Publishing options"). The config.org file lets one define these properties in a simpler way, without writing them as lisp expressions.  This is done as follows: 

A property consists of a name (the name of the property) and a value (the value of the property). In the config.org file, the name of the property is given as a top-level org-node entry and the value of the property is given as the contents of the entry. For example, to define the property "author" giving it the value "Tom Jones", one puts the following node in the config.org file: 

#+BEGIN_EXAMPLE
* author
Tom Jones
#+END_EXAMPLE

A special case are properties whose values are not strings (such as the string "Tom Jones" above), but lisp objects such as numbers, functions or other types of objects. These are indicated in the config.org file by appending ":" to the name of the property, and are entered as expressions that are evaluated by lisp, in the same line as the property name. For example, 
If a property needs to have a numerical value, or an otherwise computed value, this value is written as an expression that can be evaluated by lisp, in a single line. For example, to set the property "section-numbers" to the value "nil", one writes: 

#+BEGIN_EXAMPLE
* section-numbers: nil
#+END_EXAMPLE

Second example: To set the property "headline-levels" to 3, one writes: 

#+BEGIN_EXAMPLE
