dynsite/dynsite-html/dynsite-help.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>DynSite: Dynamic Org 2 HTML Project definition</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="DynSite: Dynamic Org 2 HTML Project definition"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-03-30 16:35:46 EEST"/>
<meta name="author" content="Ioannis Zannos"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" href="./css/org.css" type="text/css"/>


</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">DynSite: Dynamic Org 2 HTML Project definition</h1>

<p>This is a guide to using the dynamic org-to-html publishing project definition scheme called DynSite. 
</p>
<p>
DynSite is an extension of the default project publishing scheme of orgmode. Instead of writing project definitions in emacs-lisp as is done in the original orgmode publishing scheme, the present extension allows one to define and customize the projects by putting them in folders and to define their custom parameters in plain text, using orgmode markup.
</p>

<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Quick setup</a></li>
<li><a href="#sec-2">Site File Structure</a>
<ul>
<li><a href="#sec-2-1">Source and Target Folders</a></li>
<li><a href="#sec-2-2">Project Definition</a></li>
</ul>
</li>
<li><a href="#sec-3">The Project List</a>
<ul>
<li><a href="#sec-3-1">Project inheritance</a></li>
<li><a href="#sec-3-2">Org and static projects</a></li>
</ul>
</li>
<li><a href="#sec-4">Installing a Site</a></li>
<li><a href="#sec-5">Publish+Upload a Site</a></li>
<li><a href="#sec-6">Working with multiple sites</a>
<ul>
<li><a href="#sec-6-1">Adding a site</a></li>
<li><a href="#sec-6-2">Choosing one site to work with, from the list of known sites</a></li>
</ul>
</li>
<li><a href="#sec-7">Generate projects</a></li>
<li><a href="#sec-8">Publish selected project</a></li>
<li><a href="#sec-9">Utilities</a>
<ul>
<li><a href="#sec-9-1">Add project files to refile targets</a></li>
<li><a href="#sec-9-2">Force export of all files</a></li>
<li><a href="#sec-9-3">Dired site directory</a></li>
<li><a href="#sec-9-4">Edit configuration files</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Quick setup</h2>
<div class="outline-text-2" id="text-1">


<p>
<b>For a summary of all commands and quick configuration guide for setting up a site see <a href="./org-publish-command-reference.html">here</a>.</b>
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">Site File Structure</h2>
<div class="outline-text-2" id="text-2">



</div>

<div id="outline-container-2-1" class="outline-3">
<h3 id="sec-2-1">Source and Target Folders</h3>
<div class="outline-text-3" id="text-2-1">


<p>
DynSite expects all org-to-html projects to be stored as subfolders of one single folder. For example, if one has 3 projects named project1, project2 and project3, one could place them in one folder named org as follows: 
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">
<caption></caption>
<colgroup><col class="left" /><col class="left" />
</colgroup>
<thead>
<tr><th scope="col" class="left">path</th><th scope="col" class="left">contents</th></tr>
</thead>
<tbody>
<tr><td class="left">/users/user1/websites/org</td><td class="left">top folder containing all projects</td></tr>
<tr><td class="left">/users/user1/website/org/project1</td><td class="left">all files (and folders) of project1</td></tr>
<tr><td class="left">/users/user1/website/org/project2</td><td class="left">all files (and folders) of project2</td></tr>
<tr><td class="left">/users/user1/website/org/project2</td><td class="left">all files (and folders) of project3</td></tr>
</tbody>
</table>


<p>
A folder containing one or more subfolders with different projects, where each project has its own properties regarding css styles, preamble and postamble and other publishing properties, is called a <b>site</b>. These projects are published in subfolders of a single target folder, preserving the same structure as the source folder. 
</p>
<p>
It is possible to work with several different sites, where each site has its own source folder (the org project files), its own target folder (the published html files) and a url for uploading the rendered html files to a server using rsync. See <a href="#sec-6">Working with multiple sites</a> below. 
</p>
</div>

</div>

<div id="outline-container-2-2" class="outline-3">
<h3 id="sec-2-2">Project Definition</h3>
<div class="outline-text-3" id="text-2-2">


<p>
There is only one rule for defining a project: 
</p>
<p>
<b>If</b> a folder is contained in the top folder containing all projects <b>and</b> this folder contains a file called <i>config.org</i> <b>then</b> this folder becomes a project folder. 
</p>
<p>
This means: To define a new project for publishing, you must do 2 things: 
</p>
<ol>
<li>Create a folder for the project, which is contained inside the top folder holding all projects, or one of its subfolders
</li>
<li>Create a file called config.org inside the top level of the folder that contains the project. 
</li>
</ol>


<p>
The contents of the file config.org define the properties of the project, i.e. they customize the project. In orgmode, the publishing options of a project are defined as (emacs-lisp) properties. These are described in section "13.1.5 Options for the HTML/LaTeX exporters" of the org-info documentation (type "meta-x org-info" to enter the org-info documentation, then go to section (menu item) Publishing, subsection Configuration, subsubsection "Publishing options"). The config.org file lets one define these properties in a simpler way, without writing them as lisp expressions.  This is done as follows: 
</p>
<p>
A property consists of a name (the name of the property) and a value (the value of the property). In the config.org file, the name of the property is given as a top-level org-node entry and the value of the property is given as the contents of the entry. For example, to define the property "author" giving it the value "Tom Jones", one puts the following node in the config.org file: 
</p>



<pre class="example">* author
Tom Jones
</pre>


<p>
A special case are properties whose values are not strings (such as the string "Tom Jones" above), but lisp objects such as numbers, functions or other types of objects. These are indicated in the config.org file by appending ":" to the name of the property, and are entered as expressions that are evaluated by lisp, in the same line as the property name. For example, 
If a property needs to have a numerical value, or an otherwise computed value, this value is written as an expression that can be evaluated by lisp, in a single line. For example, to set the property "section-numbers" to the value "nil", one writes: 
</p>



<pre class="example">* section-numbers: nil
</pre>


<p>
Second example: To set the property "headline-levels" to 3, one writes: 
</p>
