dynsite/dynsite-org/dynsite-help.org
* headline-levels: 3
#+END_EXAMPLE

Following example compares the configuration of a project using lisp source code with the same configuration done using config.org in DynSite. 

#+BEGIN_EXAMPLE
;; Webtools project. Configuration using the original emacs-lisp code method of orgmode: 
(add-to-list 'org-publish-project-alist
	'("webtools"
	 :base-directory "~/Dropbox/orgshared/sites/org/earlab/tools/webtools/"
	 :base-extension "org"
	 :publishing-directory "~/Dropbox/orgshared/sites/html/earlab/tools/webtools/"
	 :section-numbers nil
	 :table-of-contents nil
	 :recursive t
	 :publishing-function org-publish-org-to-html
	 :headline-levels 1        
	 :auto-preamble t
	 :preamble 
	 "
<div id=\"toc\">
<a href=\"http://earlab.org/\">Earlab Home</a> | 
<a href=\"http://earlab.org/tools/webtools\">Web Tools Home</a> | 
<a href=\"http://earlab.org/tools/webtools/gettingstart.html\">Getting Started</a> | 
<a href=\"http://earlab.org/tools/webtools/javascript.html\">JavaScript</a> | 
<a href=\"http://earlab.org/tools/webtools/projects.html\">Projects</a> | 
<a href=\"http://earlab.org/tools/webtools/tutorials.html\">Tutorials</a> | 
<a href=\"http://earlab.org/tools/webtools/topics.html\">Topics</a> | 
<a href=\"http://earlab.org/tools/webtools/links.html\">Links</a> |  
</div> 

<div style = \"position: absolute; top: 10px; left: 10px; \">
 <FORM METHOD=\"POST\" ACTION=\"/tools/webtools/cgi-bin/3.0/search_engine.cgi\"><INPUT TYPE=\"text\" SIZE=\"20\" NAME=\"keywords\" MAXLENGTH=\"80\"><INPUT TYPE=\"SUBMIT\" VALUE=\"Search\"></FORM> 
</div>

"
	 :style "
<link rel=\"stylesheet\" href=\"http://ambiant.earlab.org/css/org.css\" type=\"text/css\"/>
"
	 :auto-index t
	 :table-of-contents t
	 :author "Ioannis Zannos & Aris Bezas"
	 :email  "zannos AT gmail DOT com  & aribezas AT gmail DOT com"
)
	)

;; Copy files from tool to ambiant workshop2011
(add-to-list 'org-publish-project-alist
	'("copy-webtools-files"
	 :base-directory "~/Dropbox/orgshared/sites/org/earlab/tools/webtools/"
	 :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|zip"
	 :publishing-directory "~/Dropbox/orgshared/sites/html/earlab/tools/webtools/"
	 :recursive t
	 :publishing-function org-publish-attachment
	 )

       )
#+END_EXAMPLE

To define the same project using DynSite one writes the following text in the config.org file which is contained in the folder that holds the org files of he project: 

#+BEGIN_EXAMPLE
* section-numbers: nil
* table-of-contents: nil
* recursive: t
* headline-levels: 1
* auto-preamble: t
* preamble
<div id="toc">
<a href="http://earlab.org/">Earlab Home</a> | 
<a href="http://earlab.org/tools/webtools">Web Tools Home</a> | 
<a href="http://earlab.org/tools/webtools/gettingstart.html">Getting Started</a> | 
<a href="http://earlab.org/tools/webtools/javascript.html">JavaScript</a> | 
<a href="http://earlab.org/tools/webtools/projects.html">Projects</a> | 
<a href="http://earlab.org/tools/webtools/tutorials.html">Tutorials</a> | 
<a href="http://earlab.org/tools/webtools/topics.html">Topics</a> | 
<a href="http://earlab.org/tools/webtools/links.html">Links</a> | 
</div>
* style
<link rel="stylesheet" href="./css/org.css" type="text/css"/>
* auto-index: t
* table-of-contents: t
* author: "Ioannis Zannos & Aris Bezas"
* email:  "zannos AT gmail DOT com  & aribezas AT gmail DOT com"
#+END_EXAMPLE

Note that the definition of the project is much shorter in config.org, because many items are automatically provided by DynSite based on the location and name of the folder which contains the project: 
- The name of the project is provided by the name of the folder that contains the config.org and the org content files.
- The base directory is inferred automatically.
- The publishing directory is inferred automatically.
- The publishing function is provided automatically
- The project for publishing configuration and media files (css, png, mp3, etc) is created automatically

You can add a site to the list of sites as follows (but this will not make it current):
#+BEGIN_EXAMPLE:
(add-to-list 'org-sites org-current-site '(<site name> <org path> <html path> <upload url>))
#+END_EXAMPLE:

Example: 
#+BEGIN_EXAMPLE:
(add-to-list 'org-sites
      '(
	"larigot-earlab" 
	"~/Dropbox/orgshared/sites/org/larigot-tests" 
	"~/Dropbox/orgshared/sites/html/larigot-tests" 
	"earlabor@earlab.org:public_html/larigot-tests/"))
#+END_EXAMPLE:

To add a site and make it current use the function org-install-site as described in the next section. 


* The Project List

** Project inheritance

If a project folder /a/ contains a folder /b/ that defines another project, then the project defined in folder /b/ inherits the properties of project /a/. The property values set in /b/ overwrite any properties with the same name set by /a/. /b/ is called a subproject of /a/, and /a/ is called a superproject of /b/.

The name of each project is generated from the name of the folder that contains it, and the names of its superprojects, separated by "<". For example, if we have two projects contained in folders like this: 

./mainproject
./mainproject/subproject

then the project contained in folder ./mainproject/subproject will be called subproject<mainproject. 

** Org and static projects

For each folder that contains a config.org file, DynSite generates three projects: 

1. A project for the org files of the site only. This contains the org files which will be translated to html. 
2. A "static" project containing non-org files of the site (css, jpeg, mp3, pdf or other files). These files are simply copied over to the target folder as-is, without any translation. 
3. A project including both the org-files and the non-org files. 

The non-org file projects are named by appending "-static" to the name of the org project. 
The projects containing both the org and the non-org files are named by appending "-all" to the name of the org project. 

Additionally there are generated 3 project groups: "all", "all-all", and "all-static" that contain all org, static and combined org/static projects of a site. 

* Installing a Site

Run this to install your own site in the list of sites and make it the current site to work on: 
#+BEGIN_EXAMPLE:
(org-install-site <site definition list>)
#+END_EXAMPLE:

Example: 

#+BEGIN_EXAMPLE
(org-install-site 
     '(
;; name of your site: 
	"larigot-earlab" 
;; path of the folder containing the all org project files:
	"~/Dropbox/orgshared/sites/org/larigot-tests" 
 ;; path of the folder where the html files will be published:
	"~/Dropbox/orgshared/sites/html/larigot-tests" 
 ;; this string will be used as address to upload files to web with rsync:
	"earlabor@earlab.org:public_html/larigot-tests/"
))
#+END_EXAMPLE

