dynsite/dynsite-html/dynsite-help.html



<pre class="example">* headline-levels: 3
</pre>


<p>
Following example compares the configuration of a project using lisp source code with the same configuration done using config.org in DynSite. 
</p>



<pre class="example">;; Webtools project. Configuration using the original emacs-lisp code method of orgmode: 
(add-to-list 'org-publish-project-alist
        '("webtools"
         :base-directory "~/Dropbox/orgshared/sites/org/earlab/tools/webtools/"
         :base-extension "org"
         :publishing-directory "~/Dropbox/orgshared/sites/html/earlab/tools/webtools/"
         :section-numbers nil
         :table-of-contents nil
         :recursive t
         :publishing-function org-publish-org-to-html
         :headline-levels 1        
         :auto-preamble t
         :preamble 
         "
&lt;div id=\"toc\"&gt;
&lt;a href=\"http://earlab.org/\"&gt;Earlab Home&lt;/a&gt; | 
&lt;a href=\"http://earlab.org/tools/webtools\"&gt;Web Tools Home&lt;/a&gt; | 
&lt;a href=\"http://earlab.org/tools/webtools/gettingstart.html\"&gt;Getting Started&lt;/a&gt; | 
&lt;a href=\"http://earlab.org/tools/webtools/javascript.html\"&gt;JavaScript&lt;/a&gt; | 
&lt;a href=\"http://earlab.org/tools/webtools/projects.html\"&gt;Projects&lt;/a&gt; | 
&lt;a href=\"http://earlab.org/tools/webtools/tutorials.html\"&gt;Tutorials&lt;/a&gt; | 
&lt;a href=\"http://earlab.org/tools/webtools/topics.html\"&gt;Topics&lt;/a&gt; | 
&lt;a href=\"http://earlab.org/tools/webtools/links.html\"&gt;Links&lt;/a&gt; |  
&lt;/div&gt; 

&lt;div style = \"position: absolute; top: 10px; left: 10px; \"&gt;
 &lt;FORM METHOD=\"POST\" ACTION=\"/tools/webtools/cgi-bin/3.0/search_engine.cgi\"&gt;&lt;INPUT TYPE=\"text\" SIZE=\"20\" NAME=\"keywords\" MAXLENGTH=\"80\"&gt;&lt;INPUT TYPE=\"SUBMIT\" VALUE=\"Search\"&gt;&lt;/FORM&gt; 
&lt;/div&gt;

"
         :style "
&lt;link rel=\"stylesheet\" href=\"http://ambiant.earlab.org/css/org.css\" type=\"text/css\"/&gt;
"
         :auto-index t
         :table-of-contents t
         :author "Ioannis Zannos &amp; Aris Bezas"
         :email  "zannos AT gmail DOT com  &amp; aribezas AT gmail DOT com"
)
        )

;; Copy files from tool to ambiant workshop2011
(add-to-list 'org-publish-project-alist
        '("copy-webtools-files"
         :base-directory "~/Dropbox/orgshared/sites/org/earlab/tools/webtools/"
         :base-extension "css\\|js\\|png\\|jpg\\|gif\\|pdf\\|mp3\\|ogg\\|swf\\|zip"
         :publishing-directory "~/Dropbox/orgshared/sites/html/earlab/tools/webtools/"
         :recursive t
         :publishing-function org-publish-attachment
         )

       )
</pre>


<p>
To define the same project using DynSite one writes the following text in the config.org file which is contained in the folder that holds the org files of he project: 
</p>



<pre class="example">* section-numbers: nil
* table-of-contents: nil
* recursive: t
* headline-levels: 1
* auto-preamble: t
* preamble
&lt;div id="toc"&gt;
&lt;a href="http://earlab.org/"&gt;Earlab Home&lt;/a&gt; | 
&lt;a href="http://earlab.org/tools/webtools"&gt;Web Tools Home&lt;/a&gt; | 
&lt;a href="http://earlab.org/tools/webtools/gettingstart.html"&gt;Getting Started&lt;/a&gt; | 
&lt;a href="http://earlab.org/tools/webtools/javascript.html"&gt;JavaScript&lt;/a&gt; | 
&lt;a href="http://earlab.org/tools/webtools/projects.html"&gt;Projects&lt;/a&gt; | 
&lt;a href="http://earlab.org/tools/webtools/tutorials.html"&gt;Tutorials&lt;/a&gt; | 
&lt;a href="http://earlab.org/tools/webtools/topics.html"&gt;Topics&lt;/a&gt; | 
&lt;a href="http://earlab.org/tools/webtools/links.html"&gt;Links&lt;/a&gt; | 
&lt;/div&gt;
* style
&lt;link rel="stylesheet" href="./css/org.css" type="text/css"/&gt;
* auto-index: t
* table-of-contents: t
* author: "Ioannis Zannos &amp; Aris Bezas"
* email:  "zannos AT gmail DOT com  &amp; aribezas AT gmail DOT com"
</pre>


<p>
Note that the definition of the project is much shorter in config.org, because many items are automatically provided by DynSite based on the location and name of the folder which contains the project: 
</p><ul>
<li>The name of the project is provided by the name of the folder that contains the config.org and the org content files.
</li>
<li>The base directory is inferred automatically.
</li>
<li>The publishing directory is inferred automatically.
</li>
<li>The publishing function is provided automatically
</li>
<li>The project for publishing configuration and media files (css, png, mp3, etc) is created automatically
</li>
</ul>


<p>
You can add a site to the list of sites as follows (but this will not make it current):
</p>


<pre class="example">(add-to-list 'org-sites org-current-site '(&lt;site name&gt; &lt;org path&gt; &lt;html path&gt; &lt;upload url&gt;))
</pre>


<p>
Example: 
</p>


<pre class="example">(add-to-list 'org-sites
      '(
        "larigot-earlab" 
        "~/Dropbox/orgshared/sites/org/larigot-tests" 
        "~/Dropbox/orgshared/sites/html/larigot-tests" 
        "earlabor@earlab.org:public_html/larigot-tests/"))
</pre>


<p>
To add a site and make it current use the function org-install-site as described in the next section. 
</p>

</div>
</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3">The Project List</h2>
<div class="outline-text-2" id="text-3">



</div>

<div id="outline-container-3-1" class="outline-3">
<h3 id="sec-3-1">Project inheritance</h3>
<div class="outline-text-3" id="text-3-1">


<p>
If a project folder <i>a</i> contains a folder <i>b</i> that defines another project, then the project defined in folder <i>b</i> inherits the properties of project <i>a</i>. The property values set in <i>b</i> overwrite any properties with the same name set by <i>a</i>. <i>b</i> is called a subproject of <i>a</i>, and <i>a</i> is called a superproject of <i>b</i>.
</p>
<p>
The name of each project is generated from the name of the folder that contains it, and the names of its superprojects, separated by "&lt;". For example, if we have two projects contained in folders like this: 
</p>
<p>
./mainproject
./mainproject/subproject
</p>
<p>
then the project contained in folder ./mainproject/subproject will be called subproject&lt;mainproject. 
</p>
</div>

</div>

<div id="outline-container-3-2" class="outline-3">
<h3 id="sec-3-2">Org and static projects</h3>
<div class="outline-text-3" id="text-3-2">


<p>
For each folder that contains a config.org file, DynSite generates three projects: 
</p>
<ol>
<li>A project for the org files of the site only. This contains the org files which will be translated to html. 
</li>
<li>A "static" project containing non-org files of the site (css, jpeg, mp3, pdf or other files). These files are simply copied over to the target folder as-is, without any translation. 
</li>
<li>A project including both the org-files and the non-org files. 
</li>
</ol>


<p>
The non-org file projects are named by appending "-static" to the name of the org project. 
The projects containing both the org and the non-org files are named by appending "-all" to the name of the org project. 
</p>
<p>
Additionally there are generated 3 project groups: "all", "all-all", and "all-static" that contain all org, static and combined org/static projects of a site. 
</p>
</div>
</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4">Installing a Site</h2>
<div class="outline-text-2" id="text-4">


<p>
Run this to install your own site in the list of sites and make it the current site to work on: 
</p>


<pre class="example">(org-install-site &lt;site definition list&gt;)
</pre>


<p>
Example: 
</p>



<pre class="example">(org-install-site 
     '(
;; name of your site: 
        "larigot-earlab" 
;; path of the folder containing the all org project files:
        "~/Dropbox/orgshared/sites/org/larigot-tests" 
 ;; path of the folder where the html files will be published:
        "~/Dropbox/orgshared/sites/html/larigot-tests" 
 ;; this string will be used as address to upload files to web with rsync:
        "earlabor@earlab.org:public_html/larigot-tests/"
))
</pre>


</div>

</div>
