dynsite/dynsite-html/dynsite-help.html

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5">Publish+Upload a Site</h2>
<div class="outline-text-2" id="text-5">


<p>
(meta-x:) org-republish-and-upload-site
</p>
<p>
This command is bound to the keyboard shortcut <b>super-meta-control-shift-p</b> (where "super" is the cmd key on the mac or the windows key on windows, and meta is opt or alt or escape depending on your keyboard and emacs setup). 
</p>
<p>
This is the most basic command for publishing a site. It generates all the projects of the site from the config.org files, publishes the projects, then opens a shell window and types the rsync command for uploading the site. 
</p>
</div>

</div>

<div id="outline-container-6" class="outline-2">
<h2 id="sec-6">Working with multiple sites</h2>
<div class="outline-text-2" id="text-6">



</div>

<div id="outline-container-6-1" class="outline-3">
<h3 id="sec-6-1">Adding a site</h3>
<div class="outline-text-3" id="text-6-1">


<p>
The list of known org-publish websites is stored in variable <code>org-sites</code>. This is a list of the form: 
</p>
<p>
<code>((name org-site-root org-site-html org-site-url) (name org-site-root ...) ...)</code> (see above at <a href="#sec-4">Installing a Site</a>
</p>
<p>
Each element of the list has the form (name org-site-root org-site-html org-site-url), where: 
</p>
<ul>
<li><code>name</code> is the name of the site
</li>
<li><code>org-site-root</code> is the path of the root folder containing the org files
</li>
<li><code>org-site-html</code> is the path of the root folder which will hold the exported html files. If it is nil, it is deduced from org-site-root by adding a folder "html" inside the folder org-site-root. 
</li>
<li><code>org-site-url</code> is the root url of the site, used to upload the site files with rsync
</li>
</ul>


<p>
The default value of the <code>org-sites</code> list is: 
</p>
<p>
(("default" "~/org" nil "earlabor@earlab.org:~/public_html/org/"))
</p>
<p>
This means that there is only one default site, named "default".
</p>
<p>
To add a new site definition to the list of known sites without making it current use the function <code>add-to-list</code>. Example: 
</p>
<p>
(add-to-list 'org-sites '("site2" "~/site2" "~/site2_published" "tomjones@jones.com:~/public_html/"))
</p>
<p>
To add a site and make it current use the function <code>org-install-site</code> (see above <a href="#sec-4">Installing a Site</a>) 
</p>
</div>

</div>

<div id="outline-container-6-2" class="outline-3">
<h3 id="sec-6-2">Choosing one site to work with, from the list of known sites</h3>
<div class="outline-text-3" id="text-6-2">

<ol>
<li>Type: meta-x org-choose-site
</li>
<li>Type the "tab" key to show all known sites
</li>
</ol>


<p>
Choose a site by typing the initial names of its name and using the tab-key to autocomplete the rest of the name. Then type return to install the chosen site as current. 
</p>
</div>
</div>

</div>

<div id="outline-container-7" class="outline-2">
<h2 id="sec-7">Generate projects</h2>
<div class="outline-text-2" id="text-7">


<p>
When adding a new project folder to a site, one must re-scan the folders of the site to add the new project to the list of projects of the site. The function <code>org-build-projects</code> scans the contents of the site folder for config.org files and builds all projects from their contents:
</p>
<p>
meta-x org-build-projects
</p>
<p>
This is bound to key: control-super-shift-b
</p>
</div>

</div>

<div id="outline-container-8" class="outline-2">
<h2 id="sec-8">Publish selected project</h2>
<div class="outline-text-2" id="text-8">


<p>
When a site is large, it may be time consuming to publish all projects each time that some file in one project has changed. To publish a single project from a site use function org-publish-filtering-subprojects:
</p>
<p>
meta-x org-publish-filtering-subprojects
</p>
<p>
This will let you choose a project interactively from the list of projects defined by the current site.
</p>
<p>
This function is bound to key super-B, that is: Command-key (cmd or windows icon) + shift key + b. 
</p>
</div>

</div>

<div id="outline-container-9" class="outline-2">
<h2 id="sec-9">Utilities</h2>
<div class="outline-text-2" id="text-9">



</div>

<div id="outline-container-9-1" class="outline-3">
<h3 id="sec-9-1">Add project files to refile targets</h3>
<div class="outline-text-3" id="text-9-1">


<p>
meta-x org-publish-add-all-files-to-refile-targets
</p>
<p>
This adds all 1st and 2nd level sections of all files of all projects to refile targets, making them interactively accessible through a list by org-capture-goto-target (control-u control-c control-w).
</p>
</div>

</div>

<div id="outline-container-9-2" class="outline-3">
<h3 id="sec-9-2">Force export of all files</h3>
<div class="outline-text-3" id="text-9-2">


<p>
meta-x org-reset-all-project-files
</p>
</div>

</div>

<div id="outline-container-9-3" class="outline-3">
<h3 id="sec-9-3">Dired site directory</h3>
<div class="outline-text-3" id="text-9-3">


<p>
meta-x org-dired-site
</p>
</div>

</div>

<div id="outline-container-9-4" class="outline-3">
<h3 id="sec-9-4">Edit configuration files</h3>
<div class="outline-text-3" id="text-9-4">


<p>
meta-x org-publish-edit-all-configs
</p>
</div>
</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-03-30 16:35:46 EEST</p>
<p class="author">Author: Ioannis Zannos</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
